;; -*- no-byte-compile: t; -*-

(package! dired-open)
(package! dired-subtree)

;; Addons
(package! tldr)            ;; Too long didn't read
(package! clippy)          ;; Copy-paste never was so easy
(package! resize-window)

(package! exwm)
(package! ivy-posframe)

;; Org mode
(package! org)
(package! org-roam)        ;; Org Mode smarter
(package! org-web-tools)
;; (package! org-auto-tangle) ;; Generate a script based on a .org file snippets
;; (package! org-fancy-priorities) ;;Org Mode now even more fancier

;; Editor
(package! beacon)          ;; Make cursor pretty
(package! let-alist)
(package! markdown-mode)
(package! rainbow-mode)
(package! harpoon)         ;; Switch faster between buffers 🍃

(package! toml-mode)

;; Javascript {{{
(package! prettier-js)     ;; Don't worry about tabs spacing anymore
(package! ob-typescript)
(package! vue-mode)        ;; Packages to lint Vue
(package! lsp-mode)        ;;
(package! lsp-vue)         ;;
;; }}}
